#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int main()
{
	//加减乘都很简单
	//特别：数字相加见‘强制转换’，字符相加：A↔65，a↔97，0↔48
	printf("%d\n", 'A' + 1); //66
	printf("%c\n", 96 + 1); //a

	//整数计算，结果一定是整数
	printf("%d\n", 10 / 3);
	//小数计算，结果一定是小数
	printf("%lf\n", 10.0 / 3.0);
	//整数和小数计算，结果一定是小数
	printf("%lf\n", 10 / 3.0);
	//小数直接参与计算，结果可能不准
	printf("%.20lf\n", 10.0 / 3.0);
	printf("%lf", 3.3333333333 + 6.6666666666666);
	//除数不可为0

	/*取余：
	1.运算的数据必须全为整型
	2.除数不可为0
	3.余数正负取决于被除数*/
	printf("%d\n", 10 % 3);  //1
	printf("%d\n", -10 % 3); //-1
	printf("%d\n", -10 % -3);//-1	

	//数位拆分
	printf("请输入一个三位数：");
	int a;
	scanf("%d", &a);
	int b, c, d;
	d = a % 10;
	c = (a / 10) % 10;
	b = a / 100;
	printf("其百位数是%d，十位数是%d，个位数是%d", b, c, d);

	
	//char<short<int<long<long long<float<double
	//隐式转换(小转大)：不同类型数进行计算、赋值等时触发，会先小转大再运行；char,short运算时任意情况下都是先直接升为int再运算或转换

	//强制转换(大转小)：当需要将大类型转换为小类型时，必须使用强制转换，否则编译器会报错；原理是将原数据数位从大到小删去直至符合新类型（968→68），可能会导致数据丢失或溢出
	short s1 = 10,s2=20;
	s1 = s1 + s2; //s1+s2结果为int，无法直接赋值给s1
	s1 = (short)(s1 + s2); //强制转换为short后再赋值给s1




	return 0;
}